Config/Catalogs/СтатьиОборотовПоБюджетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтатьиОборотовПоБюджетам</Name>
			<Comment>Бюджетный классификатор (ЮТЭК РС)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДоходыРасходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогиБДР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанныхДляФакта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиДанныхДляРасчетовБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоКоличеству</Name>
					<Comment>Признак использования количественных оборотов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоСумме</Name>
					<Comment>Признак использования суммовых оборотов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательИсточникаДанныхДляФактаСум</Name>
					<Comment>Показатель источника данных расчетов бюджетирования, который будет использоваться для получения фактических данных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентДляФактаСум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентДляФактаКол</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияВалютыОборотаФакт</Name>
					<Comment>Способ определения валюты оборота при получении фактических данных</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияВалютыОборотаПоСтатье</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательИсточникаДанныхДляФактаКол</Name>
					<Comment>Показатель источника данных расчетов бюджетирования, который будет использоваться для получения фактических данных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделениеПоКонтрагентам</Name>
					<Comment>Признак разделения оборотов по контрагентам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделениеПоНоменклатуре</Name>
					<Comment>Признак разделения оборотов по ресурсам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанныхДляЦены</Name>
					<Comment>Источник данных для расчетов бюджетирования, ресурс которого будет использоваться для пересчета количественных оборотов по статье в суммовые</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиДанныхДляРасчетовБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательИсточникаДанныхДляЦены</Name>
					<Comment>Показатель источника данных расчетов бюджетирования, который будет использоваться для пересчета количественного оборота по статье в суммовой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Comment>Хранилище настроек (по бух. итогам)</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекПоРегНак</Name>
					<Comment>ХранилищеНастроек по рег. накопления</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекШрифта</Name>
					<Comment>Хранилище настроек шрифта для отчетов</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательИсточникаДанныхКонтрагент</Name>
					<Comment>Показатель источника данных расчетов бюджетирования, который будет использоваться для получения фактических данных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательИсточникаДанныхНоменклатура</Name>
					<Comment>Показатель источника данных расчетов бюджетирования, который будет использоваться для получения фактических данных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Настройка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Comment>Счет бух. учета</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСубконто</Name>
							<Comment>Значние субконто бухгалтерского счета</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСубконто</Name>
							<Comment>Вид субконто бухгалтерского счета</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вычитать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кредит</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дебет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/СтатьиОборотовПоБюджетам/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДоходыРасходыПриИзменении(Элемент)
	Объект.КоэффициентДляФактаСум = Объект.ДоходыРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхДляФактаПриИзменении(Элемент)
	ЗаполнитьСписокВыборкаПоказателей();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыборкаПоказателей()
	Элементы.ПоказательИсточникаДанныхДляФактаКол.СписокВыбора.Очистить();
	Элементы.ПоказательИсточникаДанныхДляФактаСум.СписокВыбора.Очистить();
	Элементы.ПоказательИсточникаДанныхКонтрагент.СписокВыбора.Очистить();
	Элементы.ПоказательИсточникаДанныхНоменклатура.СписокВыбора.Очистить();
	
   ////// Для использования собственных отборов в статье
   ////ТекущийОбъект = ДанныеФормыВЗначение(Объект,Тип("СправочникОбъект.СтатьиОборотовПоБюджетам"));
   ////СохраненныйКомпоновщикНастроек = ТекущийОбъект.КомпоновщикНастроек.Получить();
   ////ИнициализироватьКомпоновщикСервер(СохраненныйКомпоновщикНастроек);
   //// 
    //Для использования собственных отборов в статье
	// раскоментировать если не используем собственные настройки
	ИнициализироватьКомпоновщикСервер(Неопределено);
	КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
	
	
	Для Каждого ДоступноеПоле Из КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
		Если ДоступноеПоле.Папка Тогда
			ПродолжитЬ;
		КонецЕсли;	
		Если ДоступноеПоле.Ресурс Тогда
			Элементы.ПоказательИсточникаДанныхДляФактаКол.СписокВыбора.Добавить(Строка(ДоступноеПоле.Поле),ДоступноеПоле.Заголовок);
			Элементы.ПоказательИсточникаДанныхДляФактаСум.СписокВыбора.Добавить(Строка(ДоступноеПоле.Поле),ДоступноеПоле.Заголовок);
		Иначе	
			Элементы.ПоказательИсточникаДанныхКонтрагент.СписокВыбора.Добавить(Строка(ДоступноеПоле.Поле),ДоступноеПоле.Заголовок);
			Элементы.ПоказательИсточникаДанныхНоменклатура.СписокВыбора.Добавить(Строка(ДоступноеПоле.Поле),ДоступноеПоле.Заголовок);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщикСервер(НастройкаКомпоновки)
	//Если Не ЗначениеЗаполнено(АдресСхемыКомпоновкиДанных) Тогда
	СхемаКомпоновкиДанных = Объект.ИсточникДанныхДляФакта.СхемаИсточникаДанных.Получить();
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных,УникальныйИдентификатор);
	//КонецЕсли;
	
	Если СхемаКомпоновкиДанных = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Попытка
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"),
		УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
	КонецПопытки;
	
	Если НастройкаКомпоновки = Неопределено Тогда
		СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкаКомпоновки);
		КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьСписокВыборкаПоказателей();
	//// для получения настроек из статьи оборотов
	//СохраненныйКомпоновщикНастроек = ТекущийОбъект.КомпоновщикНастроек.Получить();
	//ИнициализироватьКомпоновщикСервер(СохраненныйКомпоновщикНастроек);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПолей()
	Элементы.ПоказательИсточникаДанныхДляФактаКол.Доступность=Объект.УчетПоКоличеству;
	Элементы.КоэффициентДляФактаКол.Доступность = Объект.УчетПоКоличеству;
	
	Элементы.ПоказательИсточникаДанныхДляФактаСум.Доступность=Объект.УчетПоСумме;
	Элементы.КоэффициентДляФактаСум.Доступность = Объект.УчетПоСумме;
	Элементы.ОсновнаяВалюта.Доступность = Объект.УчетПоСумме;
	
	Элементы.ПоказательИсточникаДанныхКонтрагент.Доступность = Объект.РазделениеПоКонтрагентам;
	Элементы.ПоказательИсточникаДанныхНоменклатура.Доступность = Объект.РазделениеПоНоменклатуре;
	
КонецПроцедуры

&НаКлиенте
Процедура УчетПоКоличествуПриИзменении(Элемент)
	УстановитьДоступностьПолей();
КонецПроцедуры

&НаКлиенте
Процедура УчетПоСуммеПриИзменении(Элемент)
	УстановитьДоступностьПолей();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьПолей();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбычнуюФорму(Команда)
	ОткрытьФорму("Справочник.СтатьиОборотовПоБюджетам.Форма.ФормаЭлементаОбычная",Новый Структура("Ключ",Объект.Ссылка));
КонецПроцедуры

&НаКлиенте
Процедура РазделениеПоКонтрагентамПриИзменении(Элемент)
	УстановитьДоступностьПолей();
КонецПроцедуры

&НаКлиенте
Процедура РазделениеПоНоменклатуреПриИзменении(Элемент)
	УстановитьДоступностьПолей();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьИсточник(Команда)
	Если ЗначениеЗаполнено(Объект.ИсточникДанныхДляФакта) Тогда
		ОткрытьФорму("Справочник.ИсточникиДанныхДляРасчетовБюджетирования.ФормаОбъекта",Новый Структура("Ключ",Объект.ИсточникДанныхДляФакта),ЭтаФорма,ЭтаФорма);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.УчетПоСумме и НЕ ЗначениеЗаполнено(Объект.ОсновнаяВалюта) Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана валюта статьи";
		Сообщение.Поле = "Объект.ОсновнаяВалюта";
		Сообщение.УстановитьДанные(Объект);  //ЭтотОбъект  //Паша
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//// сохраним настройки компановщика в хранилище
	//ТекущийОбъект.КомпоновщикНастроек = Новый ХранилищеЗначения(КомпоновщикНастроек.ПолучитьНастройки());
КонецПроцедуры
